wosayttn/lv_port_nuvoton/bsp/m55m1/Library/Device/Nuvoton/M55M1/Include/_tamper_reg.h
     * |[23:16] |FAILBD    |LXT Clock Frequency Detector Fail Boundary
     * |        |          |The bits define the fail value of frequency monitor window.
     * |        |          |When LXT frequency monitor counter lower than Clock Frequency Detector Fail Boundary, the LXT frequency detect fail interrupt flag will set to 1.
     * |        |          |Note: The boundary is defined as the minimum value of LXT among 256 Tamper clock time.
     * @var TAMPER_T::VG
     * Offset: 0x30  Tamper Voltage Glitch Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PCLKSEL0  |PL0 Positive Clock Trim Range
     * |        |          |The setting value of the positive clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |        |          |Note: PL0 means the power level is 1.26V
     * |        |          |The power level is controlled in system manager
     * |[7:4]   |NCLKSEL0  |PL0 Negative Clock Trim Range
     * |        |          |The setting value of the negative clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[11:8]  |PDATSEL0  |PL0 Positive Data Trim Range
     * |        |          |The setting value of the positive data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[15:12] |NDATSEL0  |PL0 Negative Data Trim Range
     * |        |          |The setting value of the negative data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[19:16] |PCLKSEL1  |PL1 Positive Clock Trim Range
     * |        |          |The setting value of the positive clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |        |          |Note: PL1 means the power level is 1.2V
     * |[23:20] |NCLKSEL1  |PL1 Negative Clock Trim Range
     * |        |          |The setting value of the negative clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[27:24] |PDATSEL1  |PL1 Positive Data Trim Range
     * |        |          |The setting value of the positive data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[31:28] |NDATSEL1  |PL1 Negative Data Trim Range
     * |        |          |The setting value of the negative data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * @var TAMPER_T::VGEV
     * Offset: 0x34  Tamper Voltage Glitch Event Tolerance Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |VGECNTP   |Positive Voltage Glitch Error Tolerance
     * |        |          |The value indicates the tolerance count for positive voltage glitch event.
     * |[15:8]  |VGECNTN   |Negative Voltage Glitch Error Tolerance
     * |        |          |The value indicates the tolerance count for negative voltage glitch event.
     * @var TAMPER_T::LBSTRIM
     * Offset: 0x3C  Tamper LDO BIAS Trim Value Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |TLVDSEL   |Under-shoot Detect Level Trim Bits
     * |        |          |The value indicates the trim value of the under-shoot detection level
     * |[4]     |TOVDSEL   |Over-shoot Detect Level Trim Bits
     * |        |          |The value indicates the trim value of the over-shoot detection level
     * @var TAMPER_T::VG2
     * Offset: 0x40  Tamper Voltage Glitch Control Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PCLKSEL2  |PL2 Positive Clock Trim Range
     * |        |          |The setting value of the positive clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |        |          |Note: PL2 means the power level is 1.1V
     * |        |          |The power level is controlled in system manager.
     * |[7:4]   |NCLKSEL2  |PL2 Negative Clock Trim Range
     * |        |          |The setting value of the negative clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[11:8]  |PDATSEL2  |PL2 Positive Data Trim Range
     * |        |          |The setting value of the positive data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[15:12] |NDATSEL2  |PL2 Negative Data Trim Range
     * |        |          |The setting value of the negative data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[19:16] |PCLKSEL3  |PL3 Positive Clock Trim Range
     * |        |          |The setting value of the positive clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |        |          |Note: PL3 means the power level is 0.9V
     * |[23:20] |NCLKSEL3  |PL3 Negative Clock Trim Range
     * |        |          |The setting value of the negative clock tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[27:24] |PDATSEL3  |PL3 Positive Data Trim Range
     * |        |          |The setting value of the positive data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     * |[31:28] |NDATSEL3  |PL3 Negative Data Trim Range
     * |        |          |The setting value of the negative data tolerance.
     * |        |          |One step is about 2.5% tolerance. The maximum tolerance is 20%.
     */
    __IO uint32_t INIT;                  /*!< [0x0000] Tamper Function Initiation Register                              */
    __IO uint32_t FUNEN;                 /*!< [0x0004] Tamper Block Function Enable Register                            */
    __IO uint32_t TRIEN;                 /*!< [0x0008] Tamper Trigger Enable Register                                   */
    __IO uint32_t INTEN;                 /*!< [0x000c] Tamper Event Interrupt Enable Register                           */
    __IO uint32_t INTSTS;                /*!< [0x0010] Tamper Interrupt Status Register                                 */
    __IO uint32_t RESERVE0;              
    __IO uint32_t TIOCTL;                /*!< [0x0018] Tamper I/O Function Control Register                             */
    __IO uint32_t SEED;                  /*!< [0x001c] Tamper Seed Value Control Register                               */
    __IO uint32_t RESERVE1;              
    __IO uint32_t RESERVE2;              
    __IO uint32_t RESERVE3;              
    __IO uint32_t CDBR;                  /*!< [0x002c] Tamper Clock Frequency Detector Boundary Register                */
    __IO uint32_t VG;                    /*!< [0x0030] Tamper Voltage Glitch Control Register                           */
    __IO uint32_t VGEV;                  /*!< [0x0034] Tamper Voltage Glitch Event Tolerance Control Register           */
    __IO uint32_t RESERVE4;              
    __IO uint32_t LBSTRIM;               /*!< [0x003c] Tamper LDO BIAS Trim Value Control Register                      */
    __IO uint32_t VG2;                   /*!< [0x0040] Tamper Voltage Glitch Control Register 2                         */

} TAMPER_T;

/**
    @addtogroup TAMPER_CONST Tamper Bit Field Definition
    Constant Definitions for Tamper Controller
  @{
*/

#define TAMPER_INIT_TCORERST_Pos         (0)                                               /*!< TAMPER_T::INIT: TCORERST Position      */
#define TAMPER_INIT_TCORERST_Msk         (0x1ul << TAMPER_INIT_TCORERST_Pos)               /*!< TAMPER_T::INIT: TCORERST Mask          */

#define TAMPER_INIT_TLDORDY_Pos          (31)                                              /*!< TAMPER_T::INIT: TLDORDY Position       */
#define TAMPER_INIT_TLDORDY_Msk          (0x1ul << TAMPER_INIT_TLDORDY_Pos)                /*!< TAMPER_T::INIT: TLDORDY Mask           */

#define TAMPER_FUNEN_LXTDETEN_Pos        (0)                                               /*!< TAMPER_T::FUNEN: LXTDETEN Position     */
#define TAMPER_FUNEN_LXTDETEN_Msk        (0x1ul << TAMPER_FUNEN_LXTDETEN_Pos)              /*!< TAMPER_T::FUNEN: LXTDETEN Mask         */

#define TAMPER_FUNEN_TMPIOSEL_Pos        (8)                                               /*!< TAMPER_T::FUNEN: TMPIOSEL Position     */
#define TAMPER_FUNEN_TMPIOSEL_Msk        (0x3ful << TAMPER_FUNEN_TMPIOSEL_Pos)             /*!< TAMPER_T::FUNEN: TMPIOSEL Mask         */

#define TAMPER_FUNEN_HIRC48MEN_Pos       (16)                                              /*!< TAMPER_T::FUNEN: HIRC48MEN Position    */
#define TAMPER_FUNEN_HIRC48MEN_Msk       (0xfful << TAMPER_FUNEN_HIRC48MEN_Pos)            /*!< TAMPER_T::FUNEN: HIRC48MEN Mask        */

