wosayttn/lv_port_nuvoton/bsp/m55m1/Library/Device/Nuvoton/M55M1/Include/_tamper_reg.h
#define TAMPER_FUNEN_VGCHEN0_Pos         (24)                                              /*!< TAMPER_T::FUNEN: VGCHEN0 Position      */
#define TAMPER_FUNEN_VGCHEN0_Msk         (0x1ul << TAMPER_FUNEN_VGCHEN0_Pos)               /*!< TAMPER_T::FUNEN: VGCHEN0 Mask          */

#define TAMPER_FUNEN_VGCHEN1_Pos         (25)                                              /*!< TAMPER_T::FUNEN: VGCHEN1 Position      */
#define TAMPER_FUNEN_VGCHEN1_Msk         (0x1ul << TAMPER_FUNEN_VGCHEN1_Pos)               /*!< TAMPER_T::FUNEN: VGCHEN1 Mask          */

#define TAMPER_FUNEN_VGCHEN2_Pos         (26)                                              /*!< TAMPER_T::FUNEN: VGCHEN2 Position      */
#define TAMPER_FUNEN_VGCHEN2_Msk         (0x1ul << TAMPER_FUNEN_VGCHEN2_Pos)               /*!< TAMPER_T::FUNEN: VGCHEN2 Mask          */

#define TAMPER_FUNEN_VGCHEN3_Pos         (27)                                              /*!< TAMPER_T::FUNEN: VGCHEN3 Position      */
#define TAMPER_FUNEN_VGCHEN3_Msk         (0x1ul << TAMPER_FUNEN_VGCHEN3_Pos)               /*!< TAMPER_T::FUNEN: VGCHEN3 Mask          */

#define TAMPER_TRIEN_KSTRIGEN_Pos        (1)                                               /*!< TAMPER_T::TRIEN: KSTRIGEN Position     */
#define TAMPER_TRIEN_KSTRIGEN_Msk        (0x1ul << TAMPER_TRIEN_KSTRIGEN_Pos)              /*!< TAMPER_T::TRIEN: KSTRIGEN Mask         */

#define TAMPER_TRIEN_WAKEUPEN_Pos        (2)                                               /*!< TAMPER_T::TRIEN: WAKEUPEN Position     */
#define TAMPER_TRIEN_WAKEUPEN_Msk        (0x1ul << TAMPER_TRIEN_WAKEUPEN_Pos)              /*!< TAMPER_T::TRIEN: WAKEUPEN Mask         */

#define TAMPER_TRIEN_CRYPTOEN_Pos        (3)                                               /*!< TAMPER_T::TRIEN: CRYPTOEN Position     */
#define TAMPER_TRIEN_CRYPTOEN_Msk        (0x1ul << TAMPER_TRIEN_CRYPTOEN_Pos)              /*!< TAMPER_T::TRIEN: CRYPTOEN Mask         */

#define TAMPER_TRIEN_CHIPRSTEN_Pos       (4)                                               /*!< TAMPER_T::TRIEN: CHIPRSTEN Position    */
#define TAMPER_TRIEN_CHIPRSTEN_Msk       (0x1ul << TAMPER_TRIEN_CHIPRSTEN_Pos)             /*!< TAMPER_T::TRIEN: CHIPRSTEN Mask        */

#define TAMPER_TRIEN_RTCSPCLREN_Pos      (5)                                               /*!< TAMPER_T::TRIEN: RTCSPCLREN Position   */
#define TAMPER_TRIEN_RTCSPCLREN_Msk      (0x1ul << TAMPER_TRIEN_RTCSPCLREN_Pos)            /*!< TAMPER_T::TRIEN: RTCSPCLREN Mask       */

#define TAMPER_INTEN_TAMP0IEN_Pos        (0)                                               /*!< TAMPER_T::INTEN: TAMP0IEN Position     */
#define TAMPER_INTEN_TAMP0IEN_Msk        (0x1ul << TAMPER_INTEN_TAMP0IEN_Pos)              /*!< TAMPER_T::INTEN: TAMP0IEN Mask         */

#define TAMPER_INTEN_TAMP1IEN_Pos        (1)                                               /*!< TAMPER_T::INTEN: TAMP1IEN Position     */
#define TAMPER_INTEN_TAMP1IEN_Msk        (0x1ul << TAMPER_INTEN_TAMP1IEN_Pos)              /*!< TAMPER_T::INTEN: TAMP1IEN Mask         */

#define TAMPER_INTEN_TAMP2IEN_Pos        (2)                                               /*!< TAMPER_T::INTEN: TAMP2IEN Position     */
#define TAMPER_INTEN_TAMP2IEN_Msk        (0x1ul << TAMPER_INTEN_TAMP2IEN_Pos)              /*!< TAMPER_T::INTEN: TAMP2IEN Mask         */

#define TAMPER_INTEN_TAMP3IEN_Pos        (3)                                               /*!< TAMPER_T::INTEN: TAMP3IEN Position     */
#define TAMPER_INTEN_TAMP3IEN_Msk        (0x1ul << TAMPER_INTEN_TAMP3IEN_Pos)              /*!< TAMPER_T::INTEN: TAMP3IEN Mask         */

#define TAMPER_INTEN_TAMP4IEN_Pos        (4)                                               /*!< TAMPER_T::INTEN: TAMP4IEN Position     */
#define TAMPER_INTEN_TAMP4IEN_Msk        (0x1ul << TAMPER_INTEN_TAMP4IEN_Pos)              /*!< TAMPER_T::INTEN: TAMP4IEN Mask         */

#define TAMPER_INTEN_TAMP5IEN_Pos        (5)                                               /*!< TAMPER_T::INTEN: TAMP5IEN Position     */
#define TAMPER_INTEN_TAMP5IEN_Msk        (0x1ul << TAMPER_INTEN_TAMP5IEN_Pos)              /*!< TAMPER_T::INTEN: TAMP5IEN Mask         */

#define TAMPER_INTEN_CLKFIEN_Pos         (6)                                               /*!< TAMPER_T::INTEN: CLKFIEN Position      */
#define TAMPER_INTEN_CLKFIEN_Msk         (0x1ul << TAMPER_INTEN_CLKFIEN_Pos)               /*!< TAMPER_T::INTEN: CLKFIEN Mask          */

#define TAMPER_INTEN_CLKSTOPIEN_Pos      (7)                                               /*!< TAMPER_T::INTEN: CLKSTOPIEN Position   */
#define TAMPER_INTEN_CLKSTOPIEN_Msk      (0x1ul << TAMPER_INTEN_CLKSTOPIEN_Pos)            /*!< TAMPER_T::INTEN: CLKSTOPIEN Mask       */

#define TAMPER_INTEN_OVPIEN_Pos          (8)                                               /*!< TAMPER_T::INTEN: OVPIEN Position       */
#define TAMPER_INTEN_OVPIEN_Msk          (0x1ul << TAMPER_INTEN_OVPIEN_Pos)                /*!< TAMPER_T::INTEN: OVPIEN Mask           */

#define TAMPER_INTEN_VGPIEN_Pos          (9)                                               /*!< TAMPER_T::INTEN: VGPIEN Position       */
#define TAMPER_INTEN_VGPIEN_Msk          (0x1ul << TAMPER_INTEN_VGPIEN_Pos)                /*!< TAMPER_T::INTEN: VGPIEN Mask           */

#define TAMPER_INTEN_VGNIEN_Pos          (10)                                              /*!< TAMPER_T::INTEN: VGNIEN Position       */
#define TAMPER_INTEN_VGNIEN_Msk          (0x1ul << TAMPER_INTEN_VGNIEN_Pos)                /*!< TAMPER_T::INTEN: VGNIEN Mask           */

#define TAMPER_INTEN_RTCLVRIEN_Pos       (16)                                              /*!< TAMPER_T::INTEN: RTCLVRIEN Position    */
#define TAMPER_INTEN_RTCLVRIEN_Msk       (0x1ul << TAMPER_INTEN_RTCLVRIEN_Pos)             /*!< TAMPER_T::INTEN: RTCLVRIEN Mask        */

#define TAMPER_INTEN_RTCIOIEN_Pos        (17)                                              /*!< TAMPER_T::INTEN: RTCIOIEN Position     */
#define TAMPER_INTEN_RTCIOIEN_Msk        (0x1ul << TAMPER_INTEN_RTCIOIEN_Pos)              /*!< TAMPER_T::INTEN: RTCIOIEN Mask         */

#define TAMPER_INTEN_RTCLKIEN_Pos        (18)                                              /*!< TAMPER_T::INTEN: RTCLKIEN Position     */
#define TAMPER_INTEN_RTCLKIEN_Msk        (0x1ul << TAMPER_INTEN_RTCLKIEN_Pos)              /*!< TAMPER_T::INTEN: RTCLKIEN Mask         */

